In [1]:
import numpy as np
import pandas as pd

In [2]:
review=pd.read_csv("./data/filtered/review_res_on.csv")

In [3]:
def clean_df(review):
    # select only year 2016, 2017
    review.loc[:, ('date')] = pd.to_datetime(review['date'])
    review.loc[:, ('year')] = review['date'].dt.year
    review.loc[:, ('month')] = review['date'].dt.month
    review = review[review['year'] > 2015]
    review = review[['business_id','date','year','month','stars','text','useful','funny','cool']]
    
    # filter restaurants that have at least 20+ reviews in 2016 & 2017
    reviews_2016 = review[review['year'] == 2016]
    reviews_2017 = review[review['year'] == 2017]
    
    over_20_reviews_2016 = reviews_2016['business_id'].value_counts()[reviews_2016['business_id'].value_counts() >= 20].index.tolist()
    over_20_reviews_2017 = reviews_2017['business_id'].value_counts()[reviews_2017['business_id'].value_counts() >= 20].index.tolist()

    in_2016 = set(over_20_reviews_2016)
    in_2017 = set(over_20_reviews_2017)
    
    intersection = list(in_2016 & in_2017)

    review = review[review['business_id'].isin(intersection)]
    
    return review

In [4]:
df_clean = clean_df(review)

In [5]:
df_clean.head()

,business_id,date,year,month,stars,text,useful,funny,cool
19,Tn8O4tv1U-n0PRC8kbJJPg,2016-04-06,2016,4,4,Great place in Chinatown to get banh mi! Just ...,0,0,0
32,3RlylOY452bA8rwliPUeUQ,2017-01-04,2017,1,4,My sister loves this place! Probably comes by ...,1,0,0
48,An-JJle53UMHokU4MwFktg,2017-01-26,2017,1,3,my sister is a big fan of the noodles here as ...,0,0,0
49,ZilzayEdyk70SoI-wruJbg,2017-01-04,2017,1,4,This is a most stop for me and my girlfriend w...,0,0,0
54,kKNauD7d3HOvumRV7JIAfg,2016-04-01,2016,4,4,Saw that there was a new place in the neighbor...,1,0,0